backend/tests/load-tests/test.yaml
config:
  target: "https://localhost:5500"
  phases:
    - duration: 60
      arrivalRate: 100
  tls:
    rejectUnauthorized: false
  processor: "./processors.js"
scenarios:
  - flow:
      - post:
          url: "/auth/login"
          json:
            login: "login1"
            password: "pass1"
          afterResponse: "extractCookie"
      - get:
          url: "/auth/user"
          headers:
            Cookie: "token={{ token }}"